AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ИА_ВидДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВидДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ИА_ФП_ПодборЗаказаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	МассивОрганизаций = ИА_ФП.ПолучитьСписокОрганизацийГК(Организация);
	РазделятьНалБезнал = ИА_ФП.ИА_ПолучитьКонстантуРазделятьНалИБезнал();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СредстваВРезервеНаФондахОстатки.ЗП КАК Заказ,
	               |	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) * &Безнал + ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаНалОстаток, 0) * &Нал КАК Сумма,
	               |	ИА_СредстваВРезервеНаФондахОстатки.ЗП.ПредметЗаказа КАК ПредметЗаказа,
	               |	ИА_СредстваВРезервеНаФондахОстатки.ЗП.Фонд КАК Фонд,
	               |	ИА_СредстваВРезервеНаФондахОстатки.ЗП.Сумма КАК СуммаЗаявки,
	               |	ИА_СредстваВРезервеНаФондахОстатки.ЗП.Дата КАК Дата,
	               |	ИА_СредстваВРезервеНаФондахОстатки.ЗП.Номер КАК Номер,
	               |	ИА_СредстваВРезервеНаФондахОстатки.ЗП.Организация КАК Организация,
	               |	ИА_СредстваВРезервеНаФондахОстатки.ЗП.ОрганизацияДочерняя КАК ОрганизацияДочерняя
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(
	               |			&НаДату,
	               |			ВЫБОР
	               |					КОГДА &РазделятьНалБезнал = ЛОЖЬ
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ЗП.ВидДС = ЗНАЧЕНИЕ(Перечисление.ИА_ВидДенежныхСредств.Безналичные)
	               |									И &ОтображатьНал = ЛОЖЬ
	               |								ТОГДА ИСТИНА
	               |							КОГДА ЗП.ВидДС = ЗНАЧЕНИЕ(Перечисление.ИА_ВидДенежныхСредств.Наличные)
	               |									И &ОтображатьНал = ИСТИНА
	               |								ТОГДА ИСТИНА
	               |							КОГДА ЗП.ВидДС = ЗНАЧЕНИЕ(Перечисление.ИА_ВидДенежныхСредств.ПустаяСсылка)
	               |								ТОГДА ИСТИНА
	               |							ИНАЧЕ ЛОЖЬ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &ВестиФППоОрганизациям = ИСТИНА
	               |						ТОГДА Организация В (&МассивОрганизаций)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК ИА_СредстваВРезервеНаФондахОстатки";
				   
	Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
	Запрос.УстановитьПараметр("Нал", ?(Нал,1,0));
	Запрос.УстановитьПараметр("Безнал", ?(Нал,0,1));
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("ВестиФППоОрганизациям", Константы.ИА_ФП_ВестиФППоОрганизациям.Получить());

	Запрос.УстановитьПараметр("РазделятьНалБезнал", РазделятьНалБезнал);
	Запрос.УстановитьПараметр("ОтображатьНал", Нал);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		новстр = тз.Добавить();
		ЗаполнитьЗначенияСвойств(новстр, Выборка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Стр = Новый Структура("ЗП, Сумма", Элемент.ТекущиеДанные.Заказ, Элемент.ТекущиеДанные.Сумма);
	Закрыть(Стр);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	Если Элементы.ТЗ.ТекущиеДанные <> Неопределено Тогда
		Стр = Новый Структура("ЗП, Сумма", Элементы.ТЗ.ТекущиеДанные.Заказ, Элементы.ТЗ.ТекущиеДанные.Сумма);
		Закрыть(Стр);
	Иначе
		Закрыть();
	КонецЕсли;

КонецПроцедуры

//ИА_Арчил Тваладзе 2016.05.29
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	НаДату = Параметры.НаДату;
	
	ИА_ФП.ВидимостьЭлементовФормыНастройкиОрганизаций(ЭтаФорма);
	ВидимостьЭлементовФорм();
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементовФорм()
	
	РазделятьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	ИспользоватьВидДССправочно = Константы.ИА_ФП_ИспользоватьВидДССправочно.Получить();

	Если РазделятьНалБезнал Тогда
		
		Элементы.ТЗВидДС.Видимость = Истина;
		Элементы.ТЗВидДССправочно.Видимость = ложь;
		
	Иначе	
		
		Элементы.ТЗВидДС.Видимость = Ложь;
		Элементы.ТЗВидДССправочно.Видимость = ИспользоватьВидДССправочно;
		
	КонецЕсли;

КонецПроцедуры

//Конец Арчил Тваладзе
